export const FEE_TYPE = new Map([
  [1, '产品费'],
  [2, '服务费'],
  [3, '费用抵扣']
])

export const PRODUCT_TYPE = new Map([
  [0, '汇总'],
  [5, '国内机票'],
  [51, '国际机票'],
  [1, '国内酒店'],
  [11, '国际酒店'],
  [6, '国内火车'],
  [7, '国内用车'],
  [10, '国内外卖'],
  [9, '商务卡'],
  [999, '滞纳金'],
  [21, '汽车票']
])

export const FEE_CLASS = new Map([
  [0, '本期应结'],
  [1, '本期消费'],
  [2, '上期未结'],
  [3, '本期异议'],
  [4, '未取回票据'],
  [5, '跨账期退']
])

export const SETTLEMENT_STATUS = new Map([
  [0, '待生成'],
  [1, '生成中'],
  [2, '生成失败'],
  [3, '待发送'],
  [6, '待确认'],
  [9, '待开票'],
  [10, '开票中'],
  [12, '待回款'],
  [15, '部分回款'],
  [18, '已结算']
])

export const INVOICE_TYPE = new Map([
  [1, '纸质发票(票根)'],
  [2, '电子发票(专票)']
])
